Revit 2026 API

# ViewSheetSetting Class

---

Represents the View/Sheet Set (Application Menu->Print) within Autodesk Revit.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBViewSheetSetting

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ViewSheetSetting : APIObject
```
```vb
Public Class ViewSheetSetting
	Inherits APIObject
```
```cpp
public ref class ViewSheetSetting : public APIObject
```
```fsharp
type ViewSheetSetting =
    class
        inherit APIObject
    end
```

The ViewSheetSetting type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AvailableViews | All views that can be printed. |
|  | CurrentViewSheetSet | The current view sheet set of PrintSetup. |
|  | InSession | The in-session view sheet set of Print Setup. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |

|  | Name | Description |
| --- | --- | --- |
|  | Delete | Delete the current view sheet set, and make the In-Session set as the current one. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Rename | Rename the current view sheet set. |
|  | Revert | Revert the current view sheet set. |
|  | Save | Save the changes for the current view sheet set. |
|  | SaveAs | Save the current view sheet set to another view sheet set with the specified name. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace